/home/aabadie/softs/src/riot/RIOT-RC/dist/tools/openocd/openocd.sh flash
### Flashing Target ###
Open On-Chip Debugger 0.10.0+dev-00399-g09076d10 (2018-04-12-15:43)
Licensed under GNU GPL v2
For bug reports, read
	http://openocd.org/doc/doxygen/bugs.html
WARNING: interface/stlink-v2-1.cfg is deprecated, please switch to interface/stlink.cfg
hla_swd
Info : The selected transport took over low-level target control. The results might differ compared to plain JTAG/SWD
adapter speed: 1000 kHz
adapter_nsrst_delay: 100
none separate
srst_only separate srst_nogate srst_open_drain connect_deassert_srst
Info : Unable to match requested speed 1000 kHz, using 950 kHz
Info : Unable to match requested speed 1000 kHz, using 950 kHz
Info : clock speed 950 kHz
Info : STLINK v2 JTAG v28 API v2 SWIM v18 VID 0x0483 PID 0x374B
Info : using stlink api v2
Info : Target voltage: 3.261538
Info : stm32f0x.cpu: hardware has 4 breakpoints, 2 watchpoints
Info : Listening on port 35635 for gdb connections
    TargetName         Type       Endian TapName            State       
--  ------------------ ---------- ------ ------------------ ------------
 0* stm32f0x.cpu       hla_target little stm32f0x.cpu       running
Info : Unable to match requested speed 1000 kHz, using 950 kHz
Info : Unable to match requested speed 1000 kHz, using 950 kHz
adapter speed: 950 kHz
target halted due to debug-request, current mode: Thread 
xPSR: 0xc1000000 pc: 0x08000414 msp: 0x20000200
auto erase enabled
Info : device id = 0x20016448
Info : flash size = 128kbytes
target halted due to breakpoint, current mode: Thread 
xPSR: 0x61000000 pc: 0x2000003a msp: 0x20000200
wrote 10240 bytes from file /home/aabadie/softs/src/riot/RIOT-RC/tests/shell/bin/nucleo-f070rb/tests_shell.elf in 0.475593s (21.026 KiB/s)
target halted due to breakpoint, current mode: Thread 
xPSR: 0x61000000 pc: 0x2000002e msp: 0x20000200
target halted due to breakpoint, current mode: Thread 
xPSR: 0x61000000 pc: 0x2000002e msp: 0x20000200
verified 9632 bytes in 0.157235s (59.823 KiB/s)
Info : Unable to match requested speed 1000 kHz, using 950 kHz
Info : Unable to match requested speed 1000 kHz, using 950 kHz
adapter speed: 950 kHz
shutdown command invoked
Done flashing
tests/01-run.py
/home/aabadie/softs/src/riot/RIOT-RC/dist/tools/pyterm/pyterm -p "/dev/ttyACM0" -b "115200"
2018-08-08 21:57:13,447 - INFO # Connect to serial port /dev/ttyACM0
Welcome to pyterm!
Type '/exit' to exit.
2018-08-08 21:57:16,279 - INFO # main(): This is RIOT! (Version: buildtest)
2018-08-08 21:57:16,280 - INFO # test_shell.


> 
echo a string

echo a string
2018-08-08 21:57:16,386 - INFO #  echo a string
2018-08-08 21:57:16,387 - INFO # "echo""a""string"
end_test
> end_test
2018-08-08 21:57:16,442 - INFO #  end_test
2018-08-08 21:57:16,443 - INFO # [TEST_END]
reboot
> reboot
2018-08-08 21:57:16,497 - INFO #  reboot
2018-08-08 21:57:16,505 - INFO # main(): This is RIOT! (Version: buildtest)
2018-08-08 21:57:16,506 - INFO # test_shell.
ps
> ps
2018-08-08 21:57:16,559 - INFO #  ps
2018-08-08 21:57:16,561 - INFO # 	pid | state    Q | pri 
2018-08-08 21:57:16,563 - INFO # 	  1 | pending  Q |  15
2018-08-08 21:57:16,566 - INFO # 	  2 | running  Q |   7
help
> help
2018-08-08 21:57:16,619 - INFO #  help
2018-08-08 21:57:16,622 - INFO # Command              Description
2018-08-08 21:57:16,625 - INFO # ---------------------------------------
2018-08-08 21:57:16,628 - INFO # start_test           starts a test
2018-08-08 21:57:16,631 - INFO # end_test             ends a test
2018-08-08 21:57:16,635 - INFO # echo                 prints the input command
2018-08-08 21:57:16,639 - INFO # reboot               Reboot the node
2018-08-08 21:57:16,644 - INFO # ps                   Prints information about running threads.
123456789012345678901234567890123456789012345678901234567890
> 123456789012345678901234567890123456789012345678901234567890
2018-08-08 21:57:16,708 - INFO #  123456789012345678901234567890123456789012345678901234567890
2018-08-08 21:57:16,715 - INFO # shell: command not found: 123456789012345678901234567890123456789012345678901234567890
unknown_command
> unknown_command
2018-08-08 21:57:16,772 - INFO #  unknown_command
2018-08-08 21:57:16,776 - INFO # shell: command not found: unknown_command
start_test
> start_test
2018-08-08 21:57:16,832 - INFO #  start_test
2018-08-08 21:57:16,834 - INFO # [TEST_START]

